""" Выведите на экран n раз фразу "Silence is golden". Число n вводит пользователь. """

n = int(input('Сколько раз вывести?  '))

for phrases in range(0, n):
    print('Silence is golden')