""" Что нужно сделать
Дана программа, которая запрашивает у пользователя два слова, а затем выводит их на экран два раза.
Скопируйте эту программу в редактор и проверьте.
a = input('Введите первое слово: ')
b = input('Введите второе слово: ')
print(a,b)
# стереть эту строчку и вставить свой код здесь
print(a,b)

Задача: поменять значения переменных a и b местами.
Изменять, удалять, менять местами 1-ю, 2-ю, 3-ю и последнюю строчки нельзя.
Но в 4-ю строку можно вставлять сколько угодно кода, не трогая последний принт.
Пример результата работы программы: """

first_word = input('Введите первое слово: ')
second_word = input('Введите второе слово: ')
print(first_word, second_word)
