""" Найдите в программе необъявленную переменную и объявите её, присвоив ей значение ‘Кот’.

client = 'Петя'
print(client)
print(' и ')
print(pet) """

pet = 'Кот'
client = 'Петя'
print(client)
print(' и ')
print(pet)

print('-------------')

print(client, 'и', pet)