""" Задача 4. Пингвины
Юрий хочет поразвлекать своих детей за компьютером, а заодно и узнать, проявят ли они интерес к программированию.
Для этого он написал программу, которая спрашивает у пользователя количество пингвинов,
которое он хочет вывести, и затем выводит на экран столько пингвинов, сколько ввёл пользователь.

Напишите программу, которая по данному числу n от 1 до 9 выводит на экран n пингвинов. Один пингвин рисуется вот так:

print('   _~_    ')
print('  (o o)   ')
print(' /  V  \  ')
print('/(  _  )\ ')
 print('  ^^ ^^   ') """

