""" Задача 3. Следим за зубами
Стоматолог посоветовал Маше использовать зубную нить каждый чётный день. Чтобы не забывать,
Маша написала скрипт на Python, который в случае чего напоминает ей про совет стоматолога.
Напишите программу, которая проверяет, чётное ли число ввёл пользователь, и выводит соответствующее сообщение.
Подсказка: для проверки чётности используйте оператор %. """

number = int(input('Введите день: '))

if number % 2 == 0:
    print('Используйте зубную нить!')
else:
    print('День еще не наступил, но не забудьте использовать нить завтра!')